src/main/java/com/amdocs/halo/automation/xmls/CASO_BOE_QA12_NS.xml

<env:Envelope xmlns:env="http://schemas.xmlsoap.org/soap/envelope/">
   <env:Header>
      <wsse:Security env:mustUnderstand="1" xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">
         <wsse:UsernameToken wsu:Id="UsernameToken-26">
            <wsse:Username>OMS</wsse:Username>
            <wsse:Password Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordText">Oms111</wsse:Password>
         </wsse:UsernameToken>
      </wsse:Security>
   </env:Header>
   <env:Body>
      <ns0:createAndStartOrder xmlns:ns0="http://CreateAndStartOrder.createAndStartOrder.services.amdocs.com">
         <OrderingContext/>
         <CreateAndStartOrderInput>
            <orderInformationX9>
               <requestingApplicationX9>OCX</requestingApplicationX9>
               <startOrderingProcessX9>N</startOrderingProcessX9>
               <validationModeOnlyX9>N</validationModeOnlyX9>
               <sorlessOrderIndX9>N</sorlessOrderIndX9>
               <shellOrderModeX9>Y</shellOrderModeX9>
               <tnPlatformInfoX9/>
            </orderInformationX9>
            <appointmentInformationX9>
               <customerRefusesEarlyTurnupServiceIndicatorX9>N</customerRefusesEarlyTurnupServiceIndicatorX9>
               <customerRequestDueDateX9>2018-02-06</customerRequestDueDateX9>
               <isInRegionX9>false</isInRegionX9>
                <notesListX9>
                  <textX9>Restricted Account US Onshore Delivery :</textX9>
                  <typeOfNotesX9>Special Handling</typeOfNotesX9>
               </notesListX9>
               <notesListX9>
                  <textX9>Restricted Account US Citizen Delivery :</textX9>
                  <typeOfNotesX9>Special Handling</typeOfNotesX9>
               </notesListX9>
               </appointmentInformationX9>
            <customerInformationX9>
               <commonCustomerIdentifierX9>INTERNAL_100102014</commonCustomerIdentifierX9>
            </customerInformationX9>
            <projectInformationX9>
               <foreignSorIdX9>{$sorId$}</foreignSorIdX9>
               <marketStrataX9>0</marketStrataX9>
               <projectIdentifierX9>{$projId$}</projectIdentifierX9>
               <solutionIdentifierX9>UI1516697966247</solutionIdentifierX9>
            </projectInformationX9>
            <siteInformationX9/>
            <updateProductInOrderConfigurationX9>
               <configureNewOfferingX9>
                  <productDetailsX9>
                     <actionTypeListX9>
                        <actionTypeX9 xsi:nil="true" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"/>
                     </actionTypeListX9>
                     <orderActionTypeX9>PR</orderActionTypeX9>
                     <productConfigurationChangesX9>
                        <changedContainedProductsX9>
                           <attributeValueChangeX9>
                              <attributeIDX9>271</attributeIDX9>
                              <attributeNameX9>POSTALADDRESSID</attributeNameX9>
                              <valueX9>206481</valueX9>
                           </attributeValueChangeX9>
                           <attributeValueChangeX9>
                              <attributeIDX9>2991</attributeIDX9>
                              <attributeNameX9>DIALPLANIDENTIFIER</attributeNameX9>
                              <valueX9>2000000240</valueX9>
                           </attributeValueChangeX9>
                           <attributeValueChangeX9>
                              <attributeIDX9>5611795</attributeIDX9>
                              <attributeNameX9>HASIPLD</attributeNameX9>
                              <valueX9>Y</valueX9>
                           </attributeValueChangeX9>
                           <attributeValueChangeX9>
                              <attributeIDX9>5611805</attributeIDX9>
                              <attributeNameX9>HASIPLOCAL</attributeNameX9>
                              <valueX9>Y</valueX9>
                           </attributeValueChangeX9>
                           <attributeValueChangeX9>
                              <attributeIDX9>67823</attributeIDX9>
                              <attributeNameX9>ETESITEKEY</attributeNameX9>
                              <valueX9>SITEH52214</valueX9>
                           </attributeValueChangeX9>
                           <attributeValueChangeX9>
                              <attributeIDX9>5587745</attributeIDX9>
                              <attributeNameX9>ETEIPFLEXKEY</attributeNameX9>
                              <valueX9>IPFX52215</valueX9>
                           </attributeValueChangeX9>
                           <attributeValueChangeX9>
                              <attributeIDX9>5563605</attributeIDX9>
                              <attributeNameX9>BVOIPSITEID</attributeNameX9>
                              <valueX9>922517781</valueX9>
                           </attributeValueChangeX9>
                           <attributeValueChangeX9>
                              <attributeIDX9>5563615</attributeIDX9>
                              <attributeNameX9>BVOIPSITETYPE</attributeNameX9>
                              <valueX9>3</valueX9>
                           </attributeValueChangeX9>
                           <attributeValueChangeX9>
                              <attributeIDX9>68283</attributeIDX9>
                              <attributeNameX9>BASESERVICETYPE</attributeNameX9>
                              <valueX9>BVOIP</valueX9>
                           </attributeValueChangeX9>
                           <attributeValueChangeX9>
                              <attributeIDX9>67843</attributeIDX9>
                              <attributeNameX9>SERVICEFLAVOR</attributeNameX9>
                              <valueX9>IP Flexible Reach</valueX9>
                           </attributeValueChangeX9>
                           <productSpecContainmentIDX9>421</productSpecContainmentIDX9>
                           <productSpecContainmentNameX9>IPFLEXBOE.IPFLEXIBLEREACHBOE.IPFLEXMAIN</productSpecContainmentNameX9>
                        </changedContainedProductsX9>
                        <changedContainedProductsX9>
                           <attributeValueChangeX9>
                              <attributeIDX9>501</attributeIDX9>
                              <attributeNameX9>TRANSPORTTYPE</attributeNameX9>
                              <valueX9>0</valueX9>
                           </attributeValueChangeX9>
                           <attributeValueChangeX9>
                              <attributeIDX9>4981</attributeIDX9>
                              <attributeNameX9>VOIPOPTION</attributeNameX9>
                              <valueX9>IPLD,IPLOCAL</valueX9>
                           </attributeValueChangeX9>
                           <attributeValueChangeX9>
                              <attributeIDX9>9809</attributeIDX9>
                              <attributeNameX9>LECADDRESSID</attributeNameX9>
                              <valueX9>206480</valueX9>
                           </attributeValueChangeX9>
                           <productSpecContainmentIDX9>5677055</productSpecContainmentIDX9>
                           <productSpecContainmentNameX9>IPFLEXBOE.IPFLEXIBLEREACHBOE.TRANSPORTINFO</productSpecContainmentNameX9>
                        </changedContainedProductsX9>
                        <changedContainedProductsX9>
                           <attributeValueChangeX9>
                              <attributeIDX9>5563605</attributeIDX9>
                              <attributeNameX9>BVOIPSITEID</attributeNameX9>
                              <valueX9>999961331</valueX9>
                           </attributeValueChangeX9>
                           <attributeValueChangeX9>
                              <attributeIDX9>51563</attributeIDX9>
                              <attributeNameX9>HASENHANCEDFEATURES</attributeNameX9>
                              <valueX9>N</valueX9>
                           </attributeValueChangeX9>
                           <productSpecContainmentIDX9>5634595</productSpecContainmentIDX9>
                           <productSpecContainmentNameX9>IPFLEXBOE.IPFLEXIBLEREACHBOE.HUBSITEINFO</productSpecContainmentNameX9>
                        </changedContainedProductsX9>
                        <changedContainedProductsX9>
                           <attributeValueChangeX9>
                              <attributeIDX9>20089</attributeIDX9>
                              <attributeNameX9>CTNUMBER</attributeNameX9>
                              <valueX9>INTERNAL_453</valueX9>
                           </attributeValueChangeX9>
                           <attributeValueChangeX9>
                              <attributeIDX9>20099</attributeIDX9>
                              <attributeNameX9>CONTRACTEDBUSINESSNAME</attributeNameX9>
                              <valueX9>STCUSTOMERJULY-307</valueX9>
                           </attributeValueChangeX9>
                           <productSpecContainmentIDX9>20419</productSpecContainmentIDX9>
                           <productSpecContainmentNameX9>IPFLEXBOE.IPFLEXIBLEREACHBOE.CONTRACTCOMMITMENT</productSpecContainmentNameX9>
                        </changedContainedProductsX9>
                        <changedContainedProductsX9>
                           <attributeValueChangeX9>
                              <attributeIDX9>18119</attributeIDX9>
                              <attributeNameX9>E911ADDRESSID</attributeNameX9>
                              <valueX9>206482</valueX9>
                           </attributeValueChangeX9>
                           <attributeValueChangeX9>
                              <attributeIDX9>4781</attributeIDX9>
                              <attributeNameX9>CUSTOMERLOCATIONNAME</attributeNameX9>
                              <valueX9>BOE-ST4-ORDER1</valueX9>
                           </attributeValueChangeX9>
                           <attributeValueChangeX9>
                              <attributeIDX9>9739</attributeIDX9>
                              <attributeNameX9>TRADITIONALADDRESSID</attributeNameX9>
                              <valueX9>206482</valueX9>
                           </attributeValueChangeX9>
                           <attributeValueChangeX9>
                              <attributeIDX9>5735505</attributeIDX9>
                              <attributeNameX9>MSAGADDRESSID</attributeNameX9>
                              <valueX9>206483</valueX9>
                           </attributeValueChangeX9>
                           <productSpecContainmentIDX9>3241</productSpecContainmentIDX9>
                           <productSpecContainmentNameX9>IPFLEXBOE.IPFLEXIBLEREACHBOE.E911</productSpecContainmentNameX9>
                        </changedContainedProductsX9>
                        <changedContainedProductsX9>
                           <attributeValueChangeX9>
                              <attributeIDX9>4641</attributeIDX9>
                              <attributeNameX9>NUMBEROFDIRECTORIEDELIVEREDONNEWCONNECT</attributeNameX9>
                              <valueX9>1</valueX9>
                           </attributeValueChangeX9>
                           <attributeValueChangeX9>
                              <attributeIDX9>4651</attributeIDX9>
                              <attributeNameX9>NUMBEROFDIRECTORIESFORANNUALDELIVERY</attributeNameX9>
                              <valueX9>1</valueX9>
                           </attributeValueChangeX9>
                           <attributeValueChangeX9>
                              <attributeIDX9>4671</attributeIDX9>
                              <attributeNameX9>COMPANYNAME</attributeNameX9>
                              <valueX9>STCUSTOMERJULY-307</valueX9>
                           </attributeValueChangeX9>
                           <attributeValueChangeX9>
                              <attributeIDX9>4691</attributeIDX9>
                              <attributeNameX9>DIRECTORYDELIVERYADDRESSID</attributeNameX9>
                              <valueX9>206481</valueX9>
                           </attributeValueChangeX9>
                           <productSpecContainmentIDX9>5709985</productSpecContainmentIDX9>
                           <productSpecContainmentNameX9>IPFLEXBOE.IPFLEXIBLEREACHBOE.DIRECTORYDELIVERY</productSpecContainmentNameX9>
                        </changedContainedProductsX9>
                        <changedContainedProductsX9>
                           <attributeValueChangeX9>
                              <attributeIDX9>77123</attributeIDX9>
                              <attributeNameX9>TYPEOFTRIPLET</attributeNameX9>
                              <valueX9>S</valueX9>
                           </attributeValueChangeX9>
                           <attributeValueChangeX9>
                              <attributeIDX9>841</attributeIDX9>
                              <attributeNameX9>MASTERCUSTOMERNUMBER</attributeNameX9>
                              <valueX9>10267A</valueX9>
                           </attributeValueChangeX9>
                           <attributeValueChangeX9>
                              <attributeIDX9>861</attributeIDX9>
                              <attributeNameX9>SALESOFFICECODE</attributeNameX9>
                              <valueX9>12</valueX9>
                           </attributeValueChangeX9>
                           <attributeValueChangeX9>
                              <attributeIDX9>851</attributeIDX9>
                              <attributeNameX9>GROUPCODE</attributeNameX9>
                              <valueX9>DNB</valueX9>
                           </attributeValueChangeX9>
                           <naturalKeyX9>nullS</naturalKeyX9>
                           <productSpecContainmentIDX9>5632495</productSpecContainmentIDX9>
                           <productSpecContainmentNameX9>IPFLEXBOE.IPFLEXIBLEREACHBOE.ACCOUNTDETAILS</productSpecContainmentNameX9>
                        </changedContainedProductsX9>
                        <changedContainedProductsX9>
                           <attributeValueChangeX9>
                              <attributeIDX9>2031</attributeIDX9>
                              <attributeNameX9>USCALLINGPLANTYPE</attributeNameX9>
                              <valueX9>Calling Plan B</valueX9>
                           </attributeValueChangeX9>
                           <productSpecContainmentIDX9>5632585</productSpecContainmentIDX9>
                           <productSpecContainmentNameX9>IPFLEXBOE.IPFLEXIBLEREACHBOE.CALLINGPLAN.USCALLINGPLAN</productSpecContainmentNameX9>
                        </changedContainedProductsX9>
                        <changedContainedProductsX9>
                           <attributeValueChangeX9>
                              <attributeIDX9>5733335</attributeIDX9>
                              <attributeNameX9>ORDERMANAGERCONTACTID</attributeNameX9>
                              <valueX9>514369</valueX9>
                           </attributeValueChangeX9>
                           <productSpecContainmentIDX9>5632515</productSpecContainmentIDX9>
                           <productSpecContainmentNameX9>IPFLEXBOE.IPFLEXIBLEREACHBOE.CONTACTINFO</productSpecContainmentNameX9>
                        </changedContainedProductsX9>
                     </productConfigurationChangesX9>
                     <productOfferingProductSpecIDX9>5632335</productOfferingProductSpecIDX9>
                     <productOfferingProductSpecNameX9>IPFLEXBOE.IPFLEXIBLEREACHBOE</productOfferingProductSpecNameX9>
                  </productDetailsX9>
                  <productOfferingCatalogIDX9>5632325</productOfferingCatalogIDX9>
                  <productOfferingCatalogNameX9>IPFLEXBOE</productOfferingCatalogNameX9>
               </configureNewOfferingX9>
               <runCompatibilityRulesX9>false</runCompatibilityRulesX9>
            </updateProductInOrderConfigurationX9>
            <correlationIDX9>2270177</correlationIDX9>
         </CreateAndStartOrderInput>
      </ns0:createAndStartOrder>
   </env:Body>
</env:Envelope>